; ModuleID = '<stdin>'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.mtcp_context = type { i32, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.strlong = type { i8*, i64 }
%struct.Options = type { i8*, i8**, i8* }
%struct.mtcp_conf = type { i32, i32, i32, i32, i32, i32, i32 }
%struct.mtcp_epoll_event = type { i32, %union.mtcp_epoll_data }
%union.mtcp_epoll_data = type { i8* }
%struct.sockaddr_in = type { i16, i16, %struct.in_addr, [8 x i8] }
%struct.in_addr = type { i32 }
%struct.timeval = type { i64, i64 }
%struct.sockaddr = type { i16, [14 x i8] }
%struct.timezone = type { i32, i32 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.cpu_set_t = type { [16 x i64] }

@mtcp_ctx = dso_local thread_local local_unnamed_addr global %struct.mtcp_context* null, align 8, !dbg !0
@intvActionHook = common dso_local local_unnamed_addr global void (i64)* null, align 8, !dbg !60
@str = private unnamed_addr constant [29 x i8] c"CI version of app is running\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"MTCP context not initialized yet\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "mtcp_ctx", scope: !2, file: !10, line: 90, type: !15, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.0 (https://github.com/bitslab/logicalclock.git b7571fe1ee88fc60fd4cf52c38f899c904bc1700)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !59, nameTableKind: None)
!3 = !DIFile(filename: "/home/nbasu4/logicalclock/ci-llvm-v9/test-suite/mtcp-server/apps/perf/client.c", directory: "/home/nbasu4/logicalclock/ci-llvm-v9/test-suite/mtcp-server/apps/perf")
!4 = !{}
!5 = !{!6, !7, !8, !22, !29, !45, !13, !57}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_context", file: !10, line: 66, size: 128, elements: !11)
!10 = !DIFile(filename: "client.c", directory: "/home/nbasu4/logicalclock/ci-llvm-v9/test-suite/mtcp-server/apps/perf")
!11 = !{!12, !14}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "core", scope: !9, file: !10, line: 68, baseType: !13, size: 32)
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !9, file: !10, line: 69, baseType: !15, size: 64, offset: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "mctx_t", file: !16, line: 48, baseType: !17)
!16 = !DIFile(filename: "../../mtcp//include/mtcp_api.h", directory: "/home/nbasu4/logicalclock/ci-llvm-v9/test-suite/mtcp-server/apps/perf")
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtcp_context", file: !16, line: 43, size: 128, elements: !19)
!19 = !{!20, !21}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !18, file: !16, line: 45, baseType: !13, size: 32)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "mtcp_thr_ctx", scope: !18, file: !16, line: 46, baseType: !6, size: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !23, line: 30, baseType: !24)
!23 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !25, line: 26, baseType: !26)
!25 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !27, line: 41, baseType: !28)
!27 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!28 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtcp_epoll_event", file: !31, line: 44, size: 128, elements: !32)
!31 = !DIFile(filename: "../../mtcp//include/mtcp_epoll.h", directory: "/home/nbasu4/logicalclock/ci-llvm-v9/test-suite/mtcp-server/apps/perf")
!32 = !{!33, !34}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !30, file: !31, line: 46, baseType: !24, size: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !30, file: !31, line: 47, baseType: !35, size: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "mtcp_epoll_data_t", file: !31, line: 42, baseType: !36)
!36 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "mtcp_epoll_data", file: !31, line: 36, size: 64, elements: !37)
!37 = !{!38, !39, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !36, file: !31, line: 38, baseType: !6, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "sockid", scope: !36, file: !31, line: 39, baseType: !13, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "u32", scope: !36, file: !31, line: 40, baseType: !24, size: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !36, file: !31, line: 41, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !25, line: 27, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !27, line: 44, baseType: !44)
!44 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !47, line: 175, size: 128, elements: !48)
!47 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "")
!48 = !{!49, !52}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !46, file: !47, line: 177, baseType: !50, size: 16)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !51, line: 28, baseType: !7)
!51 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "")
!52 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !46, file: !47, line: 178, baseType: !53, size: 112, offset: 16)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 112, elements: !55)
!54 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!55 = !{!56}
!56 = !DISubrange(count: 14)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!59 = !{!60, !0}
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "intvActionHook", scope: !2, file: !62, line: 6, type: !63, isLocal: false, isDefinition: true)
!62 = !DIFile(filename: "ci_lib.h", directory: "/home/nbasu4/logicalclock/ci-llvm-v9/test-suite/mtcp-server/apps/perf")
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "ci_handler", file: !62, line: 1, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{null, !67}
!67 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!68 = !{!"clang version 9.0.0 (https://github.com/bitslab/logicalclock.git b7571fe1ee88fc60fd4cf52c38f899c904bc1700)"}
!69 = !{i32 2, !"Dwarf Version", i32 4}
!70 = !{i32 2, !"Debug Info Version", i32 3}
!71 = !{i32 1, !"wchar_size", i32 4}
!72 = !{i32 7, !"PIC Level", i32 2}
!73 = distinct !DISubprogram(name: "init_stats", scope: !74, file: !74, line: 5, type: !75, scopeLine: 5, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!74 = !DIFile(filename: "TriggerAction.h", directory: "/home/nbasu4/logicalclock/ci-llvm-v9/test-suite/mtcp-server/apps/perf")
!75 = !DISubroutineType(types: !76)
!76 = !{null}
!77 = !DILocation(line: 7, column: 5, scope: !73)
!78 = !DILocation(line: 8, column: 5, scope: !73)
!79 = !DILocation(line: 12, column: 3, scope: !73)
!80 = distinct !DISubprogram(name: "compiler_interrupt_handler", scope: !74, file: !74, line: 14, type: !65, scopeLine: 14, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !81)
!81 = !{!82}
!82 = !DILocalVariable(name: "ic", arg: 1, scope: !80, file: !74, line: 14, type: !67)
!83 = !DILocation(line: 0, scope: !80)
!84 = !DILocation(line: 15, column: 16, scope: !85)
!85 = distinct !DILexicalBlock(scope: !80, file: !74, line: 15, column: 8)
!86 = !{!87, !87, i64 0}
!87 = !{!"any pointer", !88, i64 0}
!88 = !{!"omnipotent char", !89, i64 0}
!89 = !{!"Simple C/C++ TBAA"}
!90 = !DILocation(line: 15, column: 26, scope: !85)
!91 = !{!92, !87, i64 8}
!92 = !{!"mtcp_context", !93, i64 0, !87, i64 8}
!93 = !{!"int", !88, i64 0}
!94 = !DILocation(line: 15, column: 8, scope: !85)
!95 = !DILocation(line: 15, column: 8, scope: !80)
!96 = !DILocation(line: 17, column: 7, scope: !97)
!97 = distinct !DILexicalBlock(scope: !85, file: !74, line: 15, column: 40)
!98 = !DILocation(line: 18, column: 5, scope: !97)
!99 = !DILocation(line: 20, column: 7, scope: !85)
!100 = !DILocation(line: 21, column: 3, scope: !80)
!101 = distinct !DISubprogram(name: "SignalHandler", scope: !10, file: !10, line: 73, type: !102, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !104)
!102 = !DISubroutineType(types: !103)
!103 = !{null, !13}
!104 = !{!105}
!105 = !DILocalVariable(name: "signum", arg: 1, scope: !101, file: !10, line: 73, type: !13)
!106 = !DILocation(line: 0, scope: !101)
!107 = !DILocation(line: 75, column: 2, scope: !101)
!108 = !DILocation(line: 76, column: 2, scope: !101)
!109 = distinct !DISubprogram(name: "print_usage", scope: !10, file: !10, line: 80, type: !102, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !110)
!110 = !{!111}
!111 = !DILocalVariable(name: "mode", arg: 1, scope: !109, file: !10, line: 80, type: !13)
!112 = !DILocation(line: 0, scope: !109)
!113 = !DILocation(line: 82, column: 24, scope: !114)
!114 = distinct !DILexicalBlock(scope: !109, file: !10, line: 82, column: 6)
!115 = !DILocation(line: 83, column: 3, scope: !116)
!116 = distinct !DILexicalBlock(scope: !114, file: !10, line: 82, column: 38)
!117 = !DILocation(line: 84, column: 2, scope: !116)
!118 = !DILocation(line: 85, column: 24, scope: !119)
!119 = distinct !DILexicalBlock(scope: !109, file: !10, line: 85, column: 6)
!120 = !DILocation(line: 86, column: 3, scope: !121)
!121 = distinct !DILexicalBlock(scope: !119, file: !10, line: 85, column: 38)
!122 = !DILocation(line: 87, column: 2, scope: !121)
!123 = !DILocation(line: 88, column: 1, scope: !109)
!124 = distinct !DISubprogram(name: "main", scope: !10, file: !10, line: 92, type: !125, scopeLine: 93, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !127)
!125 = !DISubroutineType(types: !126)
!126 = !{!13, !13, !57}
!127 = !{!128, !129, !130, !131, !132, !133, !134, !144, !145, !146, !147, !148, !149, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !178, !186, !187, !194, !195, !198, !202, !203, !204, !208, !209, !213, !214, !217, !218}
!128 = !DILocalVariable(name: "argc", arg: 1, scope: !124, file: !10, line: 92, type: !13)
!129 = !DILocalVariable(name: "argv", arg: 2, scope: !124, file: !10, line: 92, type: !57)
!130 = !DILocalVariable(name: "ret", scope: !124, file: !10, line: 95, type: !13)
!131 = !DILocalVariable(name: "i", scope: !124, file: !10, line: 95, type: !13)
!132 = !DILocalVariable(name: "c", scope: !124, file: !10, line: 95, type: !13)
!133 = !DILocalVariable(name: "mctx", scope: !124, file: !10, line: 98, type: !15)
!134 = !DILocalVariable(name: "mcfg", scope: !124, file: !10, line: 99, type: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtcp_conf", file: !16, line: 30, size: 224, elements: !136)
!136 = !{!137, !138, !139, !140, !141, !142, !143}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "num_cores", scope: !135, file: !16, line: 32, baseType: !13, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "max_concurrency", scope: !135, file: !16, line: 33, baseType: !13, size: 32, offset: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "max_num_buffers", scope: !135, file: !16, line: 35, baseType: !13, size: 32, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf_size", scope: !135, file: !16, line: 36, baseType: !13, size: 32, offset: 96)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf_size", scope: !135, file: !16, line: 37, baseType: !13, size: 32, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_timewait", scope: !135, file: !16, line: 39, baseType: !13, size: 32, offset: 160)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_timeout", scope: !135, file: !16, line: 40, baseType: !13, size: 32, offset: 192)
!144 = !DILocalVariable(name: "ctx", scope: !124, file: !10, line: 100, type: !8)
!145 = !DILocalVariable(name: "events", scope: !124, file: !10, line: 101, type: !29)
!146 = !DILocalVariable(name: "ev", scope: !124, file: !10, line: 102, type: !30)
!147 = !DILocalVariable(name: "core", scope: !124, file: !10, line: 103, type: !13)
!148 = !DILocalVariable(name: "ep_id", scope: !124, file: !10, line: 104, type: !13)
!149 = !DILocalVariable(name: "saddr", scope: !124, file: !10, line: 107, type: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !23, line: 237, size: 128, elements: !151)
!151 = !{!152, !153, !157, !161}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !150, file: !23, line: 239, baseType: !50, size: 16)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !150, file: !23, line: 240, baseType: !154, size: 16, offset: 16)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !23, line: 119, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !25, line: 25, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !27, line: 39, baseType: !7)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !150, file: !23, line: 241, baseType: !158, size: 32, offset: 32)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !23, line: 31, size: 32, elements: !159)
!159 = !{!160}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !158, file: !23, line: 33, baseType: !22, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !150, file: !23, line: 244, baseType: !162, size: 64, offset: 64)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 64, elements: !164)
!163 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!164 = !{!165}
!165 = !DISubrange(count: 8)
!166 = !DILocalVariable(name: "daddr", scope: !124, file: !10, line: 107, type: !150)
!167 = !DILocalVariable(name: "sockfd", scope: !124, file: !10, line: 108, type: !13)
!168 = !DILocalVariable(name: "backlog", scope: !124, file: !10, line: 109, type: !13)
!169 = !DILocalVariable(name: "sec_to_send", scope: !124, file: !10, line: 112, type: !13)
!170 = !DILocalVariable(name: "wrote", scope: !124, file: !10, line: 113, type: !13)
!171 = !DILocalVariable(name: "read", scope: !124, file: !10, line: 114, type: !13)
!172 = !DILocalVariable(name: "bytes_sent", scope: !124, file: !10, line: 115, type: !13)
!173 = !DILocalVariable(name: "events_ready", scope: !124, file: !10, line: 116, type: !13)
!174 = !DILocalVariable(name: "nevents", scope: !124, file: !10, line: 117, type: !13)
!175 = !DILocalVariable(name: "sent_close", scope: !124, file: !10, line: 118, type: !13)
!176 = !DILocalVariable(name: "elapsed_time", scope: !124, file: !10, line: 121, type: !177)
!177 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!178 = !DILocalVariable(name: "t1", scope: !124, file: !10, line: 122, type: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !180, line: 8, size: 128, elements: !181)
!180 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "")
!181 = !{!182, !184}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !179, file: !180, line: 10, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !27, line: 148, baseType: !67)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !179, file: !180, line: 11, baseType: !185, size: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !27, line: 150, baseType: !67)
!186 = !DILocalVariable(name: "t2", scope: !124, file: !10, line: 122, type: !179)
!187 = !DILocalVariable(name: "ts_start", scope: !124, file: !10, line: 123, type: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !189, line: 8, size: 128, elements: !190)
!189 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!190 = !{!191, !192}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !188, file: !189, line: 10, baseType: !183, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !188, file: !189, line: 11, baseType: !193, size: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !27, line: 184, baseType: !67)
!194 = !DILocalVariable(name: "now", scope: !124, file: !10, line: 123, type: !188)
!195 = !DILocalVariable(name: "end_time", scope: !124, file: !10, line: 124, type: !196)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !197, line: 7, baseType: !183)
!197 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!198 = !DILocalVariable(name: "buf", scope: !124, file: !10, line: 127, type: !199)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 65536, elements: !200)
!200 = !{!201}
!201 = !DISubrange(count: 8192)
!202 = !DILocalVariable(name: "rcvbuf", scope: !124, file: !10, line: 128, type: !199)
!203 = !DILocalVariable(name: "mode", scope: !124, file: !10, line: 131, type: !13)
!204 = !DILocalVariable(name: "__v", scope: !205, file: !10, line: 150, type: !7)
!205 = distinct !DILexicalBlock(scope: !206, file: !10, line: 150, column: 20)
!206 = distinct !DILexicalBlock(scope: !207, file: !10, line: 138, column: 40)
!207 = distinct !DILexicalBlock(scope: !124, file: !10, line: 138, column: 6)
!208 = !DILocalVariable(name: "__x", scope: !205, file: !10, line: 150, type: !7)
!209 = !DILocalVariable(name: "__v", scope: !210, file: !10, line: 164, type: !7)
!210 = distinct !DILexicalBlock(scope: !211, file: !10, line: 164, column: 20)
!211 = distinct !DILexicalBlock(scope: !212, file: !10, line: 153, column: 47)
!212 = distinct !DILexicalBlock(scope: !207, file: !10, line: 153, column: 13)
!213 = !DILocalVariable(name: "__x", scope: !210, file: !10, line: 164, type: !7)
!214 = !DILocalVariable(name: "i", scope: !215, file: !10, line: 333, type: !13)
!215 = distinct !DILexicalBlock(scope: !216, file: !10, line: 333, column: 3)
!216 = distinct !DILexicalBlock(scope: !124, file: !10, line: 330, column: 12)
!217 = !DILabel(scope: !124, name: "end_wait_loop", file: !10, line: 293)
!218 = !DILabel(scope: !124, name: "stop_timer", file: !10, line: 361)
!219 = !DILocation(line: 0, scope: !124)
!220 = !DILocation(line: 7, column: 5, scope: !73, inlinedAt: !221)
!221 = distinct !DILocation(line: 94, column: 3, scope: !124)
!222 = !DILocation(line: 8, column: 5, scope: !73, inlinedAt: !221)
!223 = !DILocation(line: 99, column: 2, scope: !124)
!224 = !DILocation(line: 102, column: 2, scope: !124)
!225 = !DILocation(line: 107, column: 2, scope: !124)
!226 = !DILocation(line: 122, column: 2, scope: !124)
!227 = !DILocation(line: 123, column: 2, scope: !124)
!228 = !DILocation(line: 127, column: 2, scope: !124)
!229 = !DILocation(line: 127, column: 7, scope: !124)
!230 = !DILocation(line: 128, column: 2, scope: !124)
!231 = !DILocation(line: 128, column: 7, scope: !124)
!232 = !DILocation(line: 133, column: 11, scope: !233)
!233 = distinct !DILexicalBlock(scope: !124, file: !10, line: 133, column: 6)
!234 = !DILocation(line: 133, column: 6, scope: !124)
!235 = !DILocation(line: 0, scope: !109, inlinedAt: !236)
!236 = distinct !DILocation(line: 134, column: 3, scope: !237)
!237 = distinct !DILexicalBlock(scope: !233, file: !10, line: 133, column: 16)
!238 = !DILocation(line: 83, column: 3, scope: !116, inlinedAt: !236)
!239 = !DILocation(line: 86, column: 3, scope: !121, inlinedAt: !236)
!240 = !DILocation(line: 135, column: 3, scope: !237)
!241 = !DILocation(line: 138, column: 14, scope: !207)
!242 = !DILocation(line: 138, column: 6, scope: !207)
!243 = !DILocation(line: 138, column: 34, scope: !207)
!244 = !DILocation(line: 138, column: 6, scope: !124)
!245 = !DILocation(line: 139, column: 12, scope: !246)
!246 = distinct !DILexicalBlock(scope: !206, file: !10, line: 139, column: 7)
!247 = !DILocation(line: 0, scope: !206)
!248 = !DILocation(line: 139, column: 7, scope: !206)
!249 = !DILocation(line: 0, scope: !109, inlinedAt: !250)
