; ModuleID = 'client.c'
source_filename = "client.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.mtcp_context = type { i32, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.mtcp_conf = type { i32, i32, i32, i32, i32, i32, i32 }
%struct.mtcp_epoll_event = type { i32, %union.mtcp_epoll_data }
%union.mtcp_epoll_data = type { i8* }
%struct.sockaddr_in = type { i16, i16, %struct.in_addr, [8 x i8] }
%struct.in_addr = type { i32 }
%struct.timeval = type { i64, i64 }
%struct.timespec = type { i64, i64 }
%struct.sockaddr = type { i16, [14 x i8] }
%struct.timezone = type { i32, i32 }

@mtcp_ctx = dso_local thread_local local_unnamed_addr global %struct.mtcp_context* null, align 8, !dbg !0
@.str.1 = private unnamed_addr constant [33 x i8] c"MTCP context not initialized yet\00", align 1
@stderr = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@.str.2 = private unnamed_addr constant [17 x i8] c"Received SIGINT\0A\00", align 1
@.str.3 = private unnamed_addr constant [74 x i8] c"(client initiates)   usage: ./client send [ip] [port] [length (seconds)]\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "mtcp_ctx", scope: !2, file: !10, line: 90, type: !15, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.0 (https://github.com/bitslab/logicalclock.git b7571fe1ee88fc60fd4cf52c38f899c904bc1700)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !59, nameTableKind: None)
!3 = !DIFile(filename: "/home/nbasu4/logicalclock/ci-llvm-v9/test-suite/mtcp-server/apps/perf/client.c", directory: "/home/nbasu4/logicalclock/ci-llvm-v9/test-suite/mtcp-server/apps/perf")
!4 = !{}
!5 = !{!6, !7, !8, !22, !29, !45, !13, !57}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_context", file: !10, line: 66, size: 128, elements: !11)
!10 = !DIFile(filename: "client.c", directory: "/home/nbasu4/logicalclock/ci-llvm-v9/test-suite/mtcp-server/apps/perf")
!11 = !{!12, !14}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "core", scope: !9, file: !10, line: 68, baseType: !13, size: 32)
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "mctx", scope: !9, file: !10, line: 69, baseType: !15, size: 64, offset: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "mctx_t", file: !16, line: 48, baseType: !17)
!16 = !DIFile(filename: "../../mtcp//include/mtcp_api.h", directory: "/home/nbasu4/logicalclock/ci-llvm-v9/test-suite/mtcp-server/apps/perf")
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtcp_context", file: !16, line: 43, size: 128, elements: !19)
!19 = !{!20, !21}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !18, file: !16, line: 45, baseType: !13, size: 32)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "mtcp_thr_ctx", scope: !18, file: !16, line: 46, baseType: !6, size: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !23, line: 30, baseType: !24)
!23 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !25, line: 26, baseType: !26)
!25 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !27, line: 41, baseType: !28)
!27 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!28 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtcp_epoll_event", file: !31, line: 44, size: 128, elements: !32)
!31 = !DIFile(filename: "../../mtcp//include/mtcp_epoll.h", directory: "/home/nbasu4/logicalclock/ci-llvm-v9/test-suite/mtcp-server/apps/perf")
!32 = !{!33, !34}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !30, file: !31, line: 46, baseType: !24, size: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !30, file: !31, line: 47, baseType: !35, size: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "mtcp_epoll_data_t", file: !31, line: 42, baseType: !36)
!36 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "mtcp_epoll_data", file: !31, line: 36, size: 64, elements: !37)
!37 = !{!38, !39, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !36, file: !31, line: 38, baseType: !6, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "sockid", scope: !36, file: !31, line: 39, baseType: !13, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "u32", scope: !36, file: !31, line: 40, baseType: !24, size: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !36, file: !31, line: 41, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !25, line: 27, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !27, line: 44, baseType: !44)
!44 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !47, line: 175, size: 128, elements: !48)
!47 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "")
!48 = !{!49, !52}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !46, file: !47, line: 177, baseType: !50, size: 16)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !51, line: 28, baseType: !7)
!51 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "")
!52 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !46, file: !47, line: 178, baseType: !53, size: 112, offset: 16)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 112, elements: !55)
!54 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!55 = !{!56}
!56 = !DISubrange(count: 14)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!59 = !{!60, !0}
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "intvActionHook", scope: !2, file: !62, line: 6, type: !63, isLocal: false, isDefinition: true)
!62 = !DIFile(filename: "ci_lib.h", directory: "/home/nbasu4/logicalclock/ci-llvm-v9/test-suite/mtcp-server/apps/perf")
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "ci_handler", file: !62, line: 1, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{null, !67}
!67 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!68 = !{i32 2, !"Dwarf Version", i32 4}
!69 = !{i32 2, !"Debug Info Version", i32 3}
!70 = !{i32 1, !"wchar_size", i32 4}
!71 = !{!"clang version 9.0.0 (https://github.com/bitslab/logicalclock.git b7571fe1ee88fc60fd4cf52c38f899c904bc1700)"}
!72 = distinct !DISubprogram(name: "init_stats", scope: !73, file: !73, line: 5, type: !74, scopeLine: 5, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!73 = !DIFile(filename: "TriggerAction.h", directory: "/home/nbasu4/logicalclock/ci-llvm-v9/test-suite/mtcp-server/apps/perf")
!74 = !DISubroutineType(types: !75)
!75 = !{null}
!76 = !DILocation(line: 7, column: 5, scope: !72)
!77 = !DILocation(line: 8, column: 5, scope: !72)
!78 = !DILocation(line: 12, column: 3, scope: !72)
!79 = distinct !DISubprogram(name: "compiler_interrupt_handler", scope: !73, file: !73, line: 14, type: !65, scopeLine: 14, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !80)
!80 = !{!81}
!81 = !DILocalVariable(name: "ic", arg: 1, scope: !79, file: !73, line: 14, type: !67)
!82 = !DILocation(line: 0, scope: !79)
!83 = !DILocation(line: 15, column: 16, scope: !84)
!84 = distinct !DILexicalBlock(scope: !79, file: !73, line: 15, column: 8)
!85 = !{!86, !86, i64 0}
!86 = !{!"any pointer", !87, i64 0}
!87 = !{!"omnipotent char", !88, i64 0}
!88 = !{!"Simple C/C++ TBAA"}
!89 = !DILocation(line: 15, column: 26, scope: !84)
!90 = !{!91, !86, i64 8}
!91 = !{!"mtcp_context", !92, i64 0, !86, i64 8}
!92 = !{!"int", !87, i64 0}
!93 = !DILocation(line: 15, column: 8, scope: !84)
!94 = !DILocation(line: 15, column: 8, scope: !79)
!95 = !DILocation(line: 17, column: 7, scope: !96)
!96 = distinct !DILexicalBlock(scope: !84, file: !73, line: 15, column: 40)
!97 = !DILocation(line: 18, column: 5, scope: !96)
!98 = !DILocation(line: 20, column: 7, scope: !84)
!99 = !DILocation(line: 21, column: 3, scope: !79)
!100 = distinct !DISubprogram(name: "SignalHandler", scope: !10, file: !10, line: 73, type: !101, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !103)
!101 = !DISubroutineType(types: !102)
!102 = !{null, !13}
!103 = !{!104}
!104 = !DILocalVariable(name: "signum", arg: 1, scope: !100, file: !10, line: 73, type: !13)
!105 = !DILocation(line: 0, scope: !100)
!106 = !DILocation(line: 75, column: 2, scope: !100)
!107 = !DILocation(line: 76, column: 2, scope: !100)
!108 = distinct !DISubprogram(name: "print_usage", scope: !10, file: !10, line: 80, type: !101, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !109)
!109 = !{!110}
!110 = !DILocalVariable(name: "mode", arg: 1, scope: !108, file: !10, line: 80, type: !13)
!111 = !DILocation(line: 0, scope: !108)
!112 = !DILocation(line: 82, column: 24, scope: !113)
!113 = distinct !DILexicalBlock(scope: !108, file: !10, line: 82, column: 6)
!114 = !DILocation(line: 83, column: 3, scope: !115)
!115 = distinct !DILexicalBlock(scope: !113, file: !10, line: 82, column: 38)
!116 = !DILocation(line: 84, column: 2, scope: !115)
!117 = !DILocation(line: 85, column: 24, scope: !118)
!118 = distinct !DILexicalBlock(scope: !108, file: !10, line: 85, column: 6)
!119 = !DILocation(line: 86, column: 3, scope: !120)
!120 = distinct !DILexicalBlock(scope: !118, file: !10, line: 85, column: 38)
!121 = !DILocation(line: 87, column: 2, scope: !120)
!122 = !DILocation(line: 88, column: 1, scope: !108)
!123 = distinct !DISubprogram(name: "main", scope: !10, file: !10, line: 92, type: !124, scopeLine: 93, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !126)
!124 = !DISubroutineType(types: !125)
!125 = !{!13, !13, !57}
!126 = !{!127, !128, !129, !130, !131, !132, !133, !143, !144, !145, !146, !147, !148, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !177, !185, !186, !193, !194, !197, !201, !202, !203, !207, !208, !212, !213, !216, !217}
!127 = !DILocalVariable(name: "argc", arg: 1, scope: !123, file: !10, line: 92, type: !13)
!128 = !DILocalVariable(name: "argv", arg: 2, scope: !123, file: !10, line: 92, type: !57)
!129 = !DILocalVariable(name: "ret", scope: !123, file: !10, line: 95, type: !13)
!130 = !DILocalVariable(name: "i", scope: !123, file: !10, line: 95, type: !13)
!131 = !DILocalVariable(name: "c", scope: !123, file: !10, line: 95, type: !13)
!132 = !DILocalVariable(name: "mctx", scope: !123, file: !10, line: 98, type: !15)
!133 = !DILocalVariable(name: "mcfg", scope: !123, file: !10, line: 99, type: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtcp_conf", file: !16, line: 30, size: 224, elements: !135)
!135 = !{!136, !137, !138, !139, !140, !141, !142}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "num_cores", scope: !134, file: !16, line: 32, baseType: !13, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "max_concurrency", scope: !134, file: !16, line: 33, baseType: !13, size: 32, offset: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "max_num_buffers", scope: !134, file: !16, line: 35, baseType: !13, size: 32, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf_size", scope: !134, file: !16, line: 36, baseType: !13, size: 32, offset: 96)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf_size", scope: !134, file: !16, line: 37, baseType: !13, size: 32, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_timewait", scope: !134, file: !16, line: 39, baseType: !13, size: 32, offset: 160)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_timeout", scope: !134, file: !16, line: 40, baseType: !13, size: 32, offset: 192)
!143 = !DILocalVariable(name: "ctx", scope: !123, file: !10, line: 100, type: !8)
!144 = !DILocalVariable(name: "events", scope: !123, file: !10, line: 101, type: !29)
!145 = !DILocalVariable(name: "ev", scope: !123, file: !10, line: 102, type: !30)
!146 = !DILocalVariable(name: "core", scope: !123, file: !10, line: 103, type: !13)
!147 = !DILocalVariable(name: "ep_id", scope: !123, file: !10, line: 104, type: !13)
!148 = !DILocalVariable(name: "saddr", scope: !123, file: !10, line: 107, type: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !23, line: 237, size: 128, elements: !150)
!150 = !{!151, !152, !156, !160}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !149, file: !23, line: 239, baseType: !50, size: 16)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !149, file: !23, line: 240, baseType: !153, size: 16, offset: 16)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !23, line: 119, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !25, line: 25, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !27, line: 39, baseType: !7)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !149, file: !23, line: 241, baseType: !157, size: 32, offset: 32)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !23, line: 31, size: 32, elements: !158)
!158 = !{!159}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !157, file: !23, line: 33, baseType: !22, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !149, file: !23, line: 244, baseType: !161, size: 64, offset: 64)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 64, elements: !163)
!162 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!163 = !{!164}
!164 = !DISubrange(count: 8)
!165 = !DILocalVariable(name: "daddr", scope: !123, file: !10, line: 107, type: !149)
!166 = !DILocalVariable(name: "sockfd", scope: !123, file: !10, line: 108, type: !13)
!167 = !DILocalVariable(name: "backlog", scope: !123, file: !10, line: 109, type: !13)
!168 = !DILocalVariable(name: "sec_to_send", scope: !123, file: !10, line: 112, type: !13)
!169 = !DILocalVariable(name: "wrote", scope: !123, file: !10, line: 113, type: !13)
!170 = !DILocalVariable(name: "read", scope: !123, file: !10, line: 114, type: !13)
!171 = !DILocalVariable(name: "bytes_sent", scope: !123, file: !10, line: 115, type: !13)
!172 = !DILocalVariable(name: "events_ready", scope: !123, file: !10, line: 116, type: !13)
!173 = !DILocalVariable(name: "nevents", scope: !123, file: !10, line: 117, type: !13)
!174 = !DILocalVariable(name: "sent_close", scope: !123, file: !10, line: 118, type: !13)
!175 = !DILocalVariable(name: "elapsed_time", scope: !123, file: !10, line: 121, type: !176)
!176 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!177 = !DILocalVariable(name: "t1", scope: !123, file: !10, line: 122, type: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !179, line: 8, size: 128, elements: !180)
!179 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "")
!180 = !{!181, !183}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !178, file: !179, line: 10, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !27, line: 148, baseType: !67)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !178, file: !179, line: 11, baseType: !184, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !27, line: 150, baseType: !67)
!185 = !DILocalVariable(name: "t2", scope: !123, file: !10, line: 122, type: !178)
!186 = !DILocalVariable(name: "ts_start", scope: !123, file: !10, line: 123, type: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !188, line: 8, size: 128, elements: !189)
!188 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !187, file: !188, line: 10, baseType: !182, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !187, file: !188, line: 11, baseType: !192, size: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !27, line: 184, baseType: !67)
!193 = !DILocalVariable(name: "now", scope: !123, file: !10, line: 123, type: !187)
!194 = !DILocalVariable(name: "end_time", scope: !123, file: !10, line: 124, type: !195)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !196, line: 7, baseType: !182)
!196 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!197 = !DILocalVariable(name: "buf", scope: !123, file: !10, line: 127, type: !198)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 65536, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 8192)
!201 = !DILocalVariable(name: "rcvbuf", scope: !123, file: !10, line: 128, type: !198)
!202 = !DILocalVariable(name: "mode", scope: !123, file: !10, line: 131, type: !13)
!203 = !DILocalVariable(name: "__v", scope: !204, file: !10, line: 150, type: !7)
!204 = distinct !DILexicalBlock(scope: !205, file: !10, line: 150, column: 20)
!205 = distinct !DILexicalBlock(scope: !206, file: !10, line: 138, column: 40)
!206 = distinct !DILexicalBlock(scope: !123, file: !10, line: 138, column: 6)
!207 = !DILocalVariable(name: "__x", scope: !204, file: !10, line: 150, type: !7)
!208 = !DILocalVariable(name: "__v", scope: !209, file: !10, line: 164, type: !7)
!209 = distinct !DILexicalBlock(scope: !210, file: !10, line: 164, column: 20)
!210 = distinct !DILexicalBlock(scope: !211, file: !10, line: 153, column: 47)
!211 = distinct !DILexicalBlock(scope: !206, file: !10, line: 153, column: 13)
!212 = !DILocalVariable(name: "__x", scope: !209, file: !10, line: 164, type: !7)
!213 = !DILocalVariable(name: "i", scope: !214, file: !10, line: 333, type: !13)
!214 = distinct !DILexicalBlock(scope: !215, file: !10, line: 333, column: 3)
!215 = distinct !DILexicalBlock(scope: !123, file: !10, line: 330, column: 12)
!216 = !DILabel(scope: !123, name: "end_wait_loop", file: !10, line: 293)
!217 = !DILabel(scope: !123, name: "stop_timer", file: !10, line: 361)
!218 = !DILocation(line: 0, scope: !123)
!219 = !DILocation(line: 7, column: 5, scope: !72, inlinedAt: !220)
!220 = distinct !DILocation(line: 94, column: 3, scope: !123)
!221 = !DILocation(line: 8, column: 5, scope: !72, inlinedAt: !220)
!222 = !DILocation(line: 99, column: 2, scope: !123)
!223 = !DILocation(line: 102, column: 2, scope: !123)
!224 = !DILocation(line: 107, column: 2, scope: !123)
!225 = !DILocation(line: 122, column: 2, scope: !123)
!226 = !DILocation(line: 123, column: 2, scope: !123)
!227 = !DILocation(line: 127, column: 2, scope: !123)
!228 = !DILocation(line: 127, column: 7, scope: !123)
!229 = !DILocation(line: 128, column: 2, scope: !123)
!230 = !DILocation(line: 128, column: 7, scope: !123)
!231 = !DILocation(line: 133, column: 11, scope: !232)
!232 = distinct !DILexicalBlock(scope: !123, file: !10, line: 133, column: 6)
!233 = !DILocation(line: 133, column: 6, scope: !123)
!234 = !DILocation(line: 0, scope: !108, inlinedAt: !235)
!235 = distinct !DILocation(line: 134, column: 3, scope: !236)
!236 = distinct !DILexicalBlock(scope: !232, file: !10, line: 133, column: 16)
!237 = !DILocation(line: 83, column: 3, scope: !115, inlinedAt: !235)
!238 = !DILocation(line: 86, column: 3, scope: !120, inlinedAt: !235)
!239 = !DILocation(line: 135, column: 3, scope: !236)
!240 = !DILocation(line: 138, column: 14, scope: !206)
!241 = !DILocation(line: 138, column: 6, scope: !206)
!242 = !DILocation(line: 138, column: 34, scope: !206)
!243 = !DILocation(line: 138, column: 6, scope: !123)
!244 = !DILocation(line: 139, column: 12, scope: !245)
!245 = distinct !DILexicalBlock(scope: !205, file: !10, line: 139, column: 7)
!246 = !DILocation(line: 0, scope: !205)
!247 = !DILocation(line: 139, column: 7, scope: !205)
!248 = !DILocation(line: 0, scope: !108, inlinedAt: !249)
